"""

TODO доступ к файлу открыт;
TODO код выполняется;
TODO определена структура хранения стержней и дисков;
TODO реализован ввод начальных условий через консоль (количество стержней, количество дисков);
TODO реализован алгоритм решения;
TODO описан принцип решения задачи по реализованному алгоритму;
TODO реализован вывод решения на экран;
TODO реализован вывод решения в файл «решение.txt».
TODO Задание не выполнено, если:
TODO
TODO не прикреплена ссылка на GitHub или Google Colab с выполненным заданием;
TODO к файлу нет доступа;
TODO код не выполняется;
TODO не определена структура хранения стержней и дисков;
TODO не реализован ввод начальных условий через консоль (количество стержней, количество дисков);
TODO не реализован алгоритм решения;
TODO не описан принцип решения задачи по реализованному алгоритму;
TODO не реализован вывод решения на экран;
TODO не реализован вывод решения в файл «решение.txt»
TODO Дедлайн 14 дней после проведения вебинара
TODO
TODO Рекомендации: для выполнения задания необходимо овладеть умениями и навыками программирования и алгоритмизации на Python, выполнив домашние задания с самопроверкой к темам 1–3. Если вы не выполнили одно или несколько заданий, сделайте это сейчас.
TODO Перед выполнением задания установите Jupyter Notebook или используйте Google Colab.
TODO
TODO Описание задания
TODO
TODO Источник: elementy.ru...ya_bashnya
TODO
TODO Описание: Ханойская башня — одна из популярных головоломок 19-го века. Даны три стержня, на один из которых нанизаны восемь колец. Кольца отличаются по размеру и лежат меньшее на большем. Нужно перенести пирамиду из восьми колец на другой стержень за наименьшее число ходов. За один ход разрешается переносить только одно кольцо, причём нельзя класть большее кольцо на меньшее.
TODO
TODO Задача: разработать и описать алгоритм решения задачи Ханойской башни, реализовать способ ввода начальных условий (количество стержней, количество дисков), реализовать вывод в консоль и в текстовый файл.
TODO
TODO Общие требования к программе
TODO ● Код грамотно декомпозирован: каждая функция отвечает за свою конкретную задачу, дублирующиеся функции переиспользуются, а их код не повторяется.
TODO ● В коде нет глобальных переменных.
TODO
TODO Шаги
TODO
TODO Определить структуру хранения стержней и дисков.
TODO Реализовать ввод начальных условий через консоль (количество стержней, количество дисков).
TODO Реализовать алгоритм решения.
TODO Описать принцип решения задачи по реализованному алгоритму.
TODO Вывести решение на экран.
TODO Записать решение в файл «решение.txt».
TODO Пример вывода
TODO  Блин 1: Стержень 1 -> Стержень 2.
TODO  Блин 1: Стержень 2 -> Стержень 3.
TODO  Блин 2: Стержень 1 -> Стержень 2.
TODO
TODO Критерии оценивания задания
TODO
TODO №	Критерий	Максимальный балл за критерий
TODO 1	Реализован алгоритм решения задачи	5
TODO 2	Описан алгоритм решения задачи в привязке с представленным кодом	6
TODO 3	Реализован алгоритм ввода начальных условий (количество стержней, количество дисков)	2
TODO 4	Реализован алгоритм вывода в консоль	2
TODO 5	Реализован алгоритм вывода в текстовый файл «решение.txt»	2
TODO Всего за задание	17
TODO
"""
