"""

todo Домашнее задание 9
todo Дисциплина Программирование и алгоритмизация на Python
todo
todo Тема 9. Регулярные выражения и основы синтаксического разбора
todo
todo Форма проверки
todo Самопроверка. Студент выполняет задание и самостоятельно проверяет его
todo
todo Имя преподавателя Иван Маслов
todo
todo Время выполнения 1 час
todo
todo Цель задания Закрепить навыки работы с регулярными выражениями
todo
todo Инструменты для выполнения ДЗ Jupyter Notebook или Google Colab
todo
todo Правила приёма работы
todo Прикрепите ссылку на выполненное задание в Google Colab или GitHub, если вы использовали Jupyter Notebook.
todo
todo Важно: убедитесь, что открыт доступ по ссылке в Google Colab. Иногда в нём нет доступа для другого логина
todo
todo Критерии оценивания
todo Задание считается выполненным, если:
todo
todo прикреплена ссылка на GitHub или Google Colab с выполненным заданием;
todo доступ к файлу открыт;
todo код даёт правильный ответ к задаче.
todo Задание не выполнено, если:
todo
todo не прикреплена ссылка на GitHub или Google Colab с выполненным заданием;
todo к файлу нет доступа;
todo код не выполняется;
todo код выдаёт ошибку или неправильный ответ к задаче.
todo Дедлайн 7 дней после даты проведения вебинара
todo
todo Описание задания
todo
todo Перед выполнением задания установите Jupyter Notebook или используйте Google Colab.
todo
todo Задание 1.
todo
todo Напишите функцию, которая принимает на вход строку и проверяет, является ли она валидным транспортным номером (1 буква, 3 цифры, 2 буквы, 2–3 цифры). Обратите внимание, что не все буквы кириллического алфавита используются в транспортных номерах.
todo
todo Если номер валиден, то функция должна возвращать отдельно номер и регион.
todo
todo Примеры работы программы:
todo car_id = 'А222BС96’
todo Результат: Номер А222BС валиден. Регион: 96.
todo
todo car_id = 'АБ22ВВ193’
todo Результат: Номер не валиден.
todo
todo Задание 2. — необязательное
todo
todo Напишите функцию, которая будет удалять все последовательные повторы слов из заданной строки при помощи регулярных выражений.
todo
todo Пример работы программы:
todo
todo some_string = ‘Напишите функцию функцию, которая будет будет будет будет удалять все все все все последовательные повторы слов из из из из заданной строки строки при помощи регулярных выражений’
todo
todo Результат: Напишите функцию, которая будет удалять все последовательные повторы слов из заданной строки при помощи регулярных выражений.
"""
